#!usr/bin/env python3

import youtube_dl
import time
import os

os.system("clear")

print("""
\33[38;5;196m██╗   ██╗ ██████╗ ██╗   ██╗████████╗██╗   ██╗██████╗ ███████╗              ██████╗ ██╗     
\33[38;5;196m╚██╗ ██╔╝██╔═══██╗██║   ██║╚══██╔══╝██║   ██║██╔══██╗██╔════╝              ██╔══██╗██║     
\33[38;5;160m ╚████╔╝ ██║   ██║██║   ██║   ██║   ██║   ██║██████╔╝█████╗      █████╗    ██║  ██║██║     
\33[38;5;160m  ╚██╔╝  ██║   ██║██║   ██║   ██║   ██║   ██║██╔══██╗██╔══╝      ╚════╝    ██║  ██║██║     
\33[38;5;124m   ██║   ╚██████╔╝╚██████╔╝   ██║   ╚██████╔╝██████╔╝███████╗              ██████╔╝███████╗
\33[38;5;124m   ╚═╝    ╚═════╝  ╚═════╝    ╚═╝    ╚═════╝ ╚═════╝ ╚══════╝              ╚═════╝ ╚══════╝
""")

ydl_opts = {}
with youtube_dl.YoutubeDL(ydl_opts) as ydl:
    ydl.download([input('\33[38;5;196m~ URL de la vidéo : ')])

print("\33[38;5;196m~ La vidéo a été téléchargé avec succès, l'application se fermera dans 5 secondes...")
time.sleep(5)